applications/test/dynamicSplitBoundaryFace/mixerVesselAMI2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libdynamicPatchSplit.so");


DebugSwitches
{
    //sweptFaceAreaWeightAMI  2;
    polyTopoChange          2;
    //cyclic                  1;
}

application     moveDynamicMesh;    //pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-2;

deltaT          1e-3;

//writeControl    adjustableRunTime;
//writeInterval   0.1;
writeControl    timeStep;
writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

// ************************************************************************* //
